app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "t"], ["content", "t"], ["created_at", "2025-04-24 08:42:59.714395"], ["updated_at", "2025-04-24 08:42:59.714395"]]
---
  def create
    @post = Post.new(post_params)

    if @post.save