app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."id" DESC LIMIT $1  [["LIMIT", 1]]

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "t"], ["description", "t"], ["created_at", "2025-04-24 09:58:36.238134"], ["updated_at", "2025-04-24 09:58:36.238134"]]